import ShelfCard from "./ShelfCard";

import img1 from "./images/img1.png";
import img2 from "./images/img2.png";

const ShelfTable = () => {
    return (
        <div className="grid grid-cols-2 sm:grid-cols-3 lg:grid-cols-4 gap-4 w-full">
            <ShelfCard
                tag="عکاسی"
                title="خدمات کسب و کار"
                imgSrc={img1}
                caption="فراخوان نمایشگاه خدمات کسب و کار
                با عنوان بازاریابی و فروش، مدیریت
                زنجیره ارزش، فناوری اطلاعات و
                زیر ساخت..."
            />
            <ShelfCard
                tag="عکاسی"
                title="خدمات کسب و کار"
                imgSrc={img2}
                caption="فراخوان نمایشگاه خدمات کسب و کار
                با عنوان بازاریابی و فروش، مدیریت
                زنجیره ارزش، فناوری اطلاعات و
                زیر ساخت..."
            />
            <ShelfCard
                tag="عکاسی"
                title="خدمات کسب و کار"
                imgSrc={img1}
                caption="فراخوان نمایشگاه خدمات کسب و کار
                با عنوان بازاریابی و فروش، مدیریت
                زنجیره ارزش، فناوری اطلاعات و
                زیر ساخت..."
            />
            <ShelfCard
                tag="عکاسی"
                title="خدمات کسب و کار"
                imgSrc={img2}
                caption="فراخوان نمایشگاه خدمات کسب و کار
                با عنوان بازاریابی و فروش، مدیریت
                زنجیره ارزش، فناوری اطلاعات و
                زیر ساخت..."
            />
            <ShelfCard
                tag="عکاسی"
                title="خدمات کسب و کار"
                imgSrc={img2}
                caption="فراخوان نمایشگاه خدمات کسب و کار
                با عنوان بازاریابی و فروش، مدیریت
                زنجیره ارزش، فناوری اطلاعات و
                زیر ساخت..."
            />
            <ShelfCard
                tag="عکاسی"
                title="خدمات کسب و کار"
                imgSrc={img1}
                caption="فراخوان نمایشگاه خدمات کسب و کار
                با عنوان بازاریابی و فروش، مدیریت
                زنجیره ارزش، فناوری اطلاعات و
                زیر ساخت..."
            />
            <ShelfCard
                tag="عکاسی"
                title="خدمات کسب و کار"
                imgSrc={img2}
                caption="فراخوان نمایشگاه خدمات کسب و کار
                با عنوان بازاریابی و فروش، مدیریت
                زنجیره ارزش، فناوری اطلاعات و
                زیر ساخت..."
            />
            <ShelfCard
                tag="عکاسی"
                title="خدمات کسب و کار"
                imgSrc={img1}
                caption="فراخوان نمایشگاه خدمات کسب و کار
                با عنوان بازاریابی و فروش، مدیریت
                زنجیره ارزش، فناوری اطلاعات و
                زیر ساخت..."
            />
            <ShelfCard
                tag="عکاسی"
                title="خدمات کسب و کار"
                imgSrc={img1}
                caption="فراخوان نمایشگاه خدمات کسب و کار
                با عنوان بازاریابی و فروش، مدیریت
                زنجیره ارزش، فناوری اطلاعات و
                زیر ساخت..."
            />
            <ShelfCard
                tag="عکاسی"
                title="خدمات کسب و کار"
                imgSrc={img2}
                caption="فراخوان نمایشگاه خدمات کسب و کار
                با عنوان بازاریابی و فروش، مدیریت
                زنجیره ارزش، فناوری اطلاعات و
                زیر ساخت..."
            />
            <ShelfCard
                tag="عکاسی"
                title="خدمات کسب و کار"
                imgSrc={img1}
                caption="فراخوان نمایشگاه خدمات کسب و کار
                با عنوان بازاریابی و فروش، مدیریت
                زنجیره ارزش، فناوری اطلاعات و
                زیر ساخت... wdad aswda sdsad sadwdwdad wasd
                wadefwsev fewgge fwefwf f ewffewfewfew 000000000"
            />
            <ShelfCard
                tag="عکاسی"
                title="خدمات کسب و کار"
                imgSrc={img2}
                caption="فراخوان نمایشگاه خدمات کسب و کار
                با عنوان بازاریابی و فروش، مدیریت
                زنجیره ارزش، فناوری اطلاعات و
                زیر ساخت..."
            />
        </div>
    );
};

export default ShelfTable;
